{
  "jokes": [
    {
      "id": 1,
      "joke": "Why did the JavaScript developer go broke? Because he used up all his cache!",
      "contributor": "Alexandra Haynes"
    },
    {
      "id": 2,
      "joke": "Why do web developers stay calm? Because they console themselves!",
      "contributor": "Alexandra Haynes"
    },
    {
      "id": 3,
      "joke": "Why don't programmers like nature? It has too many bugs!",
      "contributor": "Vishal Kumar Yadav"
    },
    {
      "id": 4,
      "joke": "Why do Java developers wear glasses? Because they don't C#!",
      "contributor": "Vishal Kumar Yadav"
    },
    {
      "id": 5,
      "joke": "Why was the JavaScript developer sad? Because they didn't Node how to Express themselves!",
      "contributor": "Adaeze Ndupu"
    },
    {
      "id": 6,
      "joke": "Why couldn't the React component understand the joke? It didn't get the context.",
      "contributor": "Adaeze Ndupu"
    },
    {
      "id": 7,
      "joke": "Why do programmers prefer dark mode? Because the light attracts bugs!",
      "contributor": "Hasan Nasuha"
    },
    {
      "id": 8,
      "joke": "Why don't programmers like nature? Because It has too many bugs and not enough documentation!",
      "contributor": "Hasan Nasuha"
    },
    {
      "id": 9,
      "joke": "Why do programmers dislike breaking up? Because they dread saying 'It's not you, it's NULL.'",
      "contributor": "Arham Khan"
    },
    {
      "id": 101,
      "joke": "Why did the React developer stay calm during a crisis? Because they knew how to handle state! 😄",
      "contributor": "Jatin Rane"
    },
    {
      "id": 100,
      "joke": " How do you comfort a JavaScript bug? You console it.'",
      "contributor": "Navdeep Jajoria"
    },
    {
      "id": 10,
      "joke": "Why does Python anger his clients? Because he's always too short with his statements.",
      "contributor": "Kobe Buckley"
    },
    {
      "id": 111,
      "joke": "Why do programmers keep Bees as pets? Because they only take one Byte!",
      "contributor": "Kobe Buckley"
    },
    {
      "id": 112,
      "joke": "student: my dog ate my homework. Teacher: Really?! Your dog ate your coding assignment? student: it did take him a couple bytes.",
      "contributor": "goobric"
    },
     {
      "id": 11,
      "joke": "How do you know when a programmer has been in the room? You can 'you smell' the leftover pizza and energy drinks!'",
      "contributor": "NongSnail"
    },
    {
      "id": 12,
      "joke": "Why do submarines all run Linux?, because you can’t open Windows under water",
      "contributor": "Shail Patel"
    },
    {
      "id": 13,
      "joke" : "How do Reach Componenets say 'you're welcome' Prop you very much!",
      "contributor": "Parth Solanki"
    }
  ]
}
